; ModuleID = 'lb_kern.c'
source_filename = "lb_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.1 = type { [2 x i32]*, i32*, i32*, [1 x i32]* }
%struct.anon.2 = type { [22 x i32]*, i32*, [1024 x i32]* }
%struct.anon.3 = type { [2 x i32]*, i32*, %struct.backend_info*, [3 x i32]* }
%struct.backend_info = type { i32, i32, i16, [6 x i8] }
%struct.anon.4 = type { [1 x i32]*, i32*, i32*, [3 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@lb_kernel_code.____fmt = internal constant [22 x i8] c"%d => [CLIENT PACKET]\00", align 1, !dbg !0
@lb_servers_init = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !215
@lb_kernel_code.____fmt.1 = internal constant [51 x i8] c"%d => [QUEUE] Using queue, no server is available!\00", align 1, !dbg !90
@lb_queue = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !251
@lb_kernel_code.____fmt.2 = internal constant [68 x i8] c"%d => [QUEUE] Unable to push to queue, queue full ! Dropping Packet\00", align 1, !dbg !97
@lb_kernel_code.____fmt.3 = internal constant [55 x i8] c"%d => [QUEUE] Using queue, packet successfully queued!\00", align 1, !dbg !102
@lb_capacity = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !231

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 144, type: !401, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "lb_kernel_code", scope: !3, file: !3, line: 117, type: !4, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !303)
!3 = !DIFile(filename: "lb_kern.c", directory: "/lb", checksumkind: CSK_MD5, checksum: "1f05db4deeaec8c4668b2654116ef482")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !9, line: 5442, size: 192, elements: !10)
!9 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "5ad8bc925dae1ec87bbb04b3148b183b")
!10 = !{!11, !15, !16, !17, !18, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 5443, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 5444, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 5445, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 5447, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !8, file: !9, line: 5448, baseType: !12, size: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !8, file: !9, line: 5450, baseType: !12, size: 32, offset: 160)
!20 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !66, globals: !89, splitDebugInlining: false, nameTableKind: None)
!21 = !{!22, !29, !60}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !9, line: 5431, baseType: !14, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!25 = !DIEnumerator(name: "XDP_DROP", value: 1)
!26 = !DIEnumerator(name: "XDP_PASS", value: 2)
!27 = !DIEnumerator(name: "XDP_TX", value: 3)
!28 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 28, baseType: !14, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!32 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!33 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!34 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!35 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!36 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!37 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!38 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!39 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!40 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!41 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!42 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!43 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!44 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!45 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!46 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!47 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!48 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!49 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!50 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!51 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!52 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!53 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!54 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!55 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!56 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!57 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!58 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!59 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 1168, baseType: !14, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "BPF_ANY", value: 0)
!63 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!64 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!65 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!66 = !{!67, !68, !71, !73, !74, !86, !87, !88}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!70 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !72)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backend_info", file: !3, line: 23, size: 128, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !75, file: !3, line: 24, baseType: !12, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !75, file: !3, line: 25, baseType: !12, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !75, file: !3, line: 26, baseType: !71, size: 16, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !75, file: !3, line: 27, baseType: !81, size: 48, offset: 80)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 48, elements: !84)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !83)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !{!85}
!85 = !DISubrange(count: 6)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!89 = !{!0, !90, !97, !102, !107, !112, !114, !116, !121, !123, !125, !130, !132, !137, !142, !147, !152, !157, !162, !167, !172, !174, !176, !181, !186, !191, !196, !201, !203, !208, !210, !215, !231, !243, !251, !266, !274, !281, !288, !293, !298}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 151, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 408, elements: !95)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!95 = !{!96}
!96 = !DISubrange(count: 51)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 158, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 544, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 68)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 161, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 440, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 55)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 168, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 584, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 73)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 181, type: !109, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 194, type: !109, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 205, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 392, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 49)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 213, type: !99, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 216, type: !104, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 222, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 472, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 59)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 225, type: !109, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 231, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 608, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 76)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 235, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 360, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 45)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 248, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 424, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 53)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 253, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 184, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 23)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 266, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 400, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 50)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 269, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 464, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 58)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 272, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 376, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 47)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 282, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 432, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 54)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 287, type: !92, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 290, type: !159, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 293, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 304, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 38)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 300, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 456, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 57)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 311, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 352, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 44)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 314, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 416, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 52)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 319, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 384, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 48)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 326, type: !92, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 329, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 640, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 80)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 379, type: !169, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "LICENSE", scope: !20, file: !3, line: 390, type: !212, isLocal: false, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 32, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 4)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "lb_servers_init", scope: !20, file: !3, line: 44, type: !217, isLocal: false, isDefinition: true)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 39, size: 256, elements: !218)
!218 = !{!219, !224, !225, !226}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !3, line: 40, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 2)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !217, file: !3, line: 41, baseType: !73, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !217, file: !3, line: 42, baseType: !73, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !217, file: !3, line: 43, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 1)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "lb_capacity", scope: !20, file: !3, line: 52, type: !233, isLocal: false, isDefinition: true)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 47, size: 256, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !3, line: 48, baseType: !220, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !233, file: !3, line: 49, baseType: !73, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !233, file: !3, line: 50, baseType: !74, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !233, file: !3, line: 51, baseType: !239, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 96, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 3)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "lb_ip_to_index", scope: !20, file: !3, line: 60, type: !245, isLocal: false, isDefinition: true)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 55, size: 256, elements: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !3, line: 56, baseType: !227, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !245, file: !3, line: 57, baseType: !73, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !245, file: !3, line: 58, baseType: !73, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !245, file: !3, line: 59, baseType: !239, size: 64, offset: 192)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "lb_queue", scope: !20, file: !3, line: 67, type: !253, isLocal: false, isDefinition: true)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 63, size: 192, elements: !254)
!254 = !{!255, !260, !261}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !3, line: 64, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 704, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 22)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !253, file: !3, line: 65, baseType: !73, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !253, file: !3, line: 66, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32768, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 1024)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !20, file: !268, line: 177, type: !269, isLocal: true, isDefinition: true)
!268 = !DIFile(filename: "libbpf/src/bpf_helper_defs.h", directory: "/lb", checksumkind: CSK_MD5, checksum: "5260f06f90b94eed43b746c45e4828c2")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !273, !12, null}
!272 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !20, file: !268, line: 56, type: !276, isLocal: true, isDefinition: true)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!67, !67, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "bpf_map_push_elem", scope: !20, file: !268, line: 2289, type: !283, isLocal: true, isDefinition: true)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!272, !67, !279, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !287)
!287 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !20, file: !268, line: 78, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!272, !67, !279, !279, !286}
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "bpf_map_pop_elem", scope: !20, file: !268, line: 2299, type: !295, isLocal: true, isDefinition: true)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!272, !67, !67}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_tail", scope: !20, file: !268, line: 1722, type: !300, isLocal: true, isDefinition: true)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!272, !7, !6}
!303 = !{!304, !305, !306, !307, !318, !347, !356, !357, !358, !361, !362, !363, !364, !365, !368, !369, !372, !373, !375, !377, !378, !379, !380, !383, !384, !385, !386, !389, !390, !393, !395, !396, !397, !398, !399, !400}
!304 = !DILocalVariable(name: "info", arg: 1, scope: !2, file: !3, line: 117, type: !7)
!305 = !DILocalVariable(name: "begin", scope: !2, file: !3, line: 118, type: !67)
!306 = !DILocalVariable(name: "end", scope: !2, file: !3, line: 119, type: !67)
!307 = !DILocalVariable(name: "eth", scope: !2, file: !3, line: 120, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !310, line: 168, size: 112, elements: !311)
!310 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!311 = !{!312, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !309, file: !310, line: 169, baseType: !313, size: 48)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 48, elements: !84)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !309, file: !310, line: 170, baseType: !313, size: 48, offset: 48)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !309, file: !310, line: 171, baseType: !316, size: 16, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !317, line: 25, baseType: !71)
!317 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!318 = !DILocalVariable(name: "iph", scope: !2, file: !3, line: 127, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !321, line: 87, size: 160, elements: !322)
!321 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !333}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !320, file: !321, line: 89, baseType: !82, size: 4, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !320, file: !321, line: 90, baseType: !82, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !320, file: !321, line: 97, baseType: !82, size: 8, offset: 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !320, file: !321, line: 98, baseType: !316, size: 16, offset: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !320, file: !321, line: 99, baseType: !316, size: 16, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !320, file: !321, line: 100, baseType: !316, size: 16, offset: 48)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !320, file: !321, line: 101, baseType: !82, size: 8, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !320, file: !321, line: 102, baseType: !82, size: 8, offset: 72)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !320, file: !321, line: 103, baseType: !332, size: 16, offset: 80)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !317, line: 31, baseType: !71)
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !320, file: !321, line: 104, baseType: !334, size: 64, offset: 96)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !320, file: !321, line: 104, size: 64, elements: !335)
!335 = !{!336, !342}
!336 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !321, line: 104, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !321, line: 104, size: 64, elements: !338)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !337, file: !321, line: 104, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !317, line: 27, baseType: !12)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !337, file: !321, line: 104, baseType: !340, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !334, file: !321, line: 104, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !321, line: 104, size: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !343, file: !321, line: 104, baseType: !340, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !343, file: !321, line: 104, baseType: !340, size: 32, offset: 32)
!347 = !DILocalVariable(name: "udph", scope: !2, file: !3, line: 134, type: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !350, line: 23, size: 64, elements: !351)
!350 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !349, file: !350, line: 24, baseType: !316, size: 16)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !349, file: !350, line: 25, baseType: !316, size: 16, offset: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !349, file: !350, line: 26, baseType: !316, size: 16, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !349, file: !350, line: 27, baseType: !332, size: 16, offset: 48)
!356 = !DILocalVariable(name: "destport", scope: !2, file: !3, line: 138, type: !71)
!357 = !DILocalVariable(name: "payload_size", scope: !2, file: !3, line: 142, type: !12)
!358 = !DILocalVariable(name: "key", scope: !359, file: !3, line: 146, type: !12)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 143, column: 28)
!360 = distinct !DILexicalBlock(scope: !2, file: !3, line: 143, column: 9)
!361 = !DILocalVariable(name: "max_thr", scope: !359, file: !3, line: 147, type: !12)
!362 = !DILocalVariable(name: "max_thr_ind", scope: !359, file: !3, line: 147, type: !12)
!363 = !DILocalVariable(name: "rv_value", scope: !359, file: !3, line: 148, type: !73)
!364 = !DILocalVariable(name: "b_info", scope: !359, file: !3, line: 149, type: !74)
!365 = !DILocalVariable(name: "payload", scope: !366, file: !3, line: 152, type: !67)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 150, column: 49)
!367 = distinct !DILexicalBlock(scope: !359, file: !3, line: 150, column: 13)
!368 = !DILocalVariable(name: "rv", scope: !366, file: !3, line: 156, type: !272)
!369 = !DILocalVariable(name: "payload", scope: !370, file: !3, line: 207, type: !67)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 204, column: 27)
!371 = distinct !DILexicalBlock(scope: !359, file: !3, line: 204, column: 13)
!372 = !DILocalVariable(name: "rv", scope: !370, file: !3, line: 211, type: !272)
!373 = !DILocalVariable(name: "rv_update", scope: !374, file: !3, line: 229, type: !272)
!374 = distinct !DILexicalBlock(scope: !371, file: !3, line: 219, column: 14)
!375 = !DILocalVariable(name: "key", scope: !376, file: !3, line: 255, type: !12)
!376 = distinct !DILexicalBlock(scope: !360, file: !3, line: 252, column: 10)
!377 = !DILocalVariable(name: "insert_value", scope: !376, file: !3, line: 255, type: !12)
!378 = !DILocalVariable(name: "srcip", scope: !376, file: !3, line: 257, type: !12)
!379 = !DILocalVariable(name: "index_value", scope: !376, file: !3, line: 258, type: !73)
!380 = !DILocalVariable(name: "rv_value", scope: !381, file: !3, line: 261, type: !73)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 259, column: 34)
!382 = distinct !DILexicalBlock(scope: !376, file: !3, line: 259, column: 13)
!383 = !DILocalVariable(name: "index_rv", scope: !381, file: !3, line: 267, type: !272)
!384 = !DILocalVariable(name: "b_info", scope: !381, file: !3, line: 274, type: !75)
!385 = !DILocalVariable(name: "rv", scope: !376, file: !3, line: 297, type: !74)
!386 = !DILocalVariable(name: "qt", scope: !387, file: !3, line: 305, type: !12)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 303, column: 14)
!388 = distinct !DILexicalBlock(scope: !376, file: !3, line: 298, column: 13)
!389 = !DILocalVariable(name: "rv_pop", scope: !387, file: !3, line: 306, type: !272)
!390 = !DILocalVariable(name: "rvl", scope: !391, file: !3, line: 317, type: !272)
!391 = distinct !DILexicalBlock(scope: !392, file: !3, line: 307, column: 29)
!392 = distinct !DILexicalBlock(scope: !387, file: !3, line: 307, column: 17)
!393 = !DILocalVariable(name: "tail_adj_rv", scope: !394, file: !3, line: 327, type: !272)
!394 = distinct !DILexicalBlock(scope: !392, file: !3, line: 324, column: 18)
!395 = !DILocalVariable(name: "p_begin", scope: !394, file: !3, line: 333, type: !67)
!396 = !DILocalVariable(name: "p_end", scope: !394, file: !3, line: 334, type: !67)
!397 = !DILocalVariable(name: "p_eth", scope: !394, file: !3, line: 336, type: !308)
!398 = !DILocalVariable(name: "p_iph", scope: !394, file: !3, line: 341, type: !319)
!399 = !DILocalVariable(name: "p_udph", scope: !394, file: !3, line: 347, type: !348)
!400 = !DILocalVariable(name: "p_data", scope: !394, file: !3, line: 373, type: !67)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 176, elements: !258)
!402 = !{i32 7, !"Dwarf Version", i32 5}
